<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-dev","backend":"8d8565d4131200cb59a8ab1421d6ce32239b01b40c8422b38aa8f56cf399081b","plan_job_ref":"Job Post Terraform plan to PR comment #195 at https://github.com/GSA-TTS/atj-platform/actions/runs/10307046524","plan_out_hash":"4dd591efba34064f02b6e160eef6043249fc15a763436d1847efcae6a9a90586","plan_hash":"780ad4e8f7e8f2361f1bd0eec72fb6dfc0c9ccbf6bd6d8a2d2652cee949bcd7a","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __tts-10x-atj-dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-doj_tts-10x-atj-dev-server-doj-app_380DB029" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-doj:c02062ae22b8815f328a1f01a795b7772464a643"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "6e003acf-4bc4-497b-9116-10a28dcdf37e"
        }

+       service_binding {
+           service_instance = "b4cba13d-f667-40eb-95e1-308eec6a5673"
        }
    }

  # cloudfoundry_app.tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1 will be created
+   resource "cloudfoundry_app" "tts-10x-atj-dev-server-kansas_tts-10x-atj-dev-server-kansas-app_337A9CF1" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-kansas:c02062ae22b8815f328a1f01a795b7772464a643"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-dev-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "97f871cd-ea2a-4728-a556-aa7d34204f75"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "fa9cb908-8382-4a28-97d4-c298ebebdb6f"
        }

+       service_binding {
+           service_instance = "83d706dc-757e-41da-bba8-505095c55bd0"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #195](https://github.com/GSA-TTS/atj-platform/actions/runs/10307046524)